lectures/16-sql/notes.org
* SQL, dplyr, pandas

Today's lecture is a little ambitious because I want to teach you
several related things (or at least make it clear they are related).

We begin with SQL which itself began in 1973, making the language just
about 50 years old. You can think of SQL as standing for "Structured
Query Language" but everyone just pronounces it like the english word
"sequel."

The purpose of SQL is to let users "query" a relational database.

1. a relational database is a structured database where every bit of
   data is stored in tables as a matter of implementation and where
   those table function as "relations" as a matter of convention.
2. a query is a _program_ which operates in the context of a database
   which returns a table of data.

Often the precise exigencies which demand that software engineers use
a relational database are abstract to the data scientist, but to
encourage comeradery and the general dissemination of knowledge I'll
try to explain why the world is set up this way. Data scientists often
analyze data which is _already_ joined into a single table, and thus
might find the design of databases obscure without additional
context. And since you may find yourself needing to interact with
databases from time to time, its worth commenting on why they are the
way they are.

The main idea is the efficient representation of complex data in a way
which makes it easy to maintain and limits the potential for
errors. An example is clarifying:

Imagine a database of students on UNC's campus. We may wish to know
their name, birthday, major and current address.  As data scientists
we probabaly imagine this looking something like this sort of table:


#+NAME: students_table
| first_name | last_name | birth_date | major         | address              |
|------------+-----------+------------+---------------+----------------------|
| Nathan     | Hedley    | 02/18/1961 | Culinary Arts | 123 Franklin Street  |
| Michelle   | MacArthur | 03/26/1999 | Physics       | 123 Franklin Street  |
| ...        |           |            |               |                      |

But consider the following fact: For each major we may wish to store
other information (like the building it operates out of, the courses
you must complete for it, the current head of the department,
etc). And this is true for addresses also (some addresses may be
dormitories on campus, for instance). We could put these extra columns
into the above table in some cases (although putting a row in this
table for each course required by each major seems a bit absurd), but
that still leaves a lot of potential for error.

For example, if a student changes her address, we must find every row
that student appears and modify their address. If we forget or make a
mistake, the data begins to become trecherous and misleading.

Thus we normalize our databases, which means, basically, that we have
one table for each sort of thing and we record information only once
in the whole database. 

The above data might be stored as something like:

#+NAME: students_table
| student_id | first_name | last_name | major_id | address_id |
|------------+------------+-----------+----------+------------|
|          0 | Nathan     | Hedley    |        0 |          0 |
|          1 | Michelle   | MacArthur |       10 |          0 |
|        ... |            |           |          |            |

#+NAME: major_table
| major_id | text_name     | department_head |
|----------+---------------+-----------------|
|        0 | Culinary Arts | Swedish Chef    |
|      ... | ...           | ...             |
|       10 | Physics       |                 |

#+NAME: major_course_requirements
| major_id | course_id |
|----------+-----------|
|        0 |        10 |
|        0 |        13 |
|        1 |        15 |
|        1 |        12 |
| ...      |           |

And you can imagine further. 

With this sort of design if something changes about a course (for
instance, its description) we only need to update one entry in one
table. The rest of the data remains coherent. 

The price to pay for splitting our data up like this is, of course,
that any particular question we might want to ask requires crawling
all over the database.

Consider a question like: What courses does Nathan Hedly need to take
to finish his major?

Consider a more interesting question:

Of all the students taking Physics 330 who are also physics majors,
what is the average number of courses they have left to graduate?

The data we need to answer these questions is in our database, but we
need a way to _query_ the database to extract it. Enter SQL!

* SQL

SQL is a programming language similar to the ones we already know but
strange in a few ways.

1. The chunks of text we must digest to know understand what an SQL
   program does are large. In a regular language we can ask what "10"
   means but SQL programs can only result in tables and thus we need
   enough program to at least produce a table.
2. Its very verbose. Originally called the structured _english_ query
   language SQL makes a half-hearted attempt to make SQL programs seem
   like english. This is a weird goal which is out of style.

Despite these considerations, we can make progress with SQL in more or
less the same way that we would in another language. 

Why should you, the budding data scientist, learn SQL?

1. You will probably need to extract data from an SQL database at some
   point in your life.
2. Even if that never happens, you might need to put data into an SQL
   database if its too big to fit in memory and you need to work with
   it. Databases are designed to work on datasets much larger than you
   can fit into a tibble or even load into memory.

