lectures/16-sql/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-25 Mon 15:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="toups" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org73e2df1">1. SQL, dplyr, pandas</a></li>
<li><a href="#org907845e">2. SQL</a></li>
<li><a href="#orgd3c69c5">3. SQLite</a></li>
<li><a href="#orga5edbbc">4. Using SQLite.</a></li>
<li><a href="#org2ee4cc3">5. Getting Data into the Database</a></li>
<li><a href="#orga2792f3">6. SELECT</a></li>
<li><a href="#org12f4a98">7. JOINS</a></li>
<li><a href="#org91d3eff">8. CTEs (Common Table Expressions)</a></li>
<li><a href="#org978e694">9. Saving the Results of a Query</a></li>
<li><a href="#org07cf9d2">10. Using R to Work with SQL(lite)</a></li>
<li><a href="#orge8dfa35">11. More to Come</a></li>
</ul>
</div>
</div>
<div id="outline-container-org73e2df1" class="outline-2">
<h2 id="org73e2df1"><span class="section-number-2">1</span> SQL, dplyr, pandas</h2>
<div class="outline-text-2" id="text-1">
<p>
Today's lecture is a little ambitious because I want to teach you
several related things (or at least make it clear they are related).
</p>

<p>
We begin with SQL which itself began in 1973, making the language just
about 50 years old. You can think of SQL as standing for "Structured
Query Language" but everyone just pronounces it like the english word
"sequel."
</p>

<p>
The purpose of SQL is to let users "query" a relational database.
</p>

<ol class="org-ol">
<li>a relational database is a structured database where every bit of
data is stored in tables as a matter of implementation and where
those table function as "relations" as a matter of convention.</li>
<li>a query is a <span class="underline">program</span> which operates in the context of a database
which returns a table of data.</li>
</ol>

<p>
Often the precise exigencies which demand that software engineers use
a relational database are abstract to the data scientist, but to
encourage comeradery and the general dissemination of knowledge I'll
try to explain why the world is set up this way. Data scientists often
analyze data which is <span class="underline">already</span> joined into a single table, and thus
might find the design of databases obscure without additional
context. And since you may find yourself needing to interact with
databases from time to time, its worth commenting on why they are the
way they are.
</p>

<p>
The main idea is the efficient representation of complex data in a way
which makes it easy to maintain and limits the potential for
errors. An example is clarifying:
</p>

<p>
Imagine a database of students on UNC's campus. We may wish to know
their name, birthday, major and current address.  As data scientists
we probabaly imagine this looking something like this sort of table:
</p>


<table id="org55d6ad0" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">first<sub>name</sub></th>
<th scope="col" class="org-left">last<sub>name</sub></th>
<th scope="col" class="org-left">birth<sub>date</sub></th>
<th scope="col" class="org-left">major</th>
<th scope="col" class="org-left">address</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Nathan</td>
<td class="org-left">Hedley</td>
<td class="org-left">02/18/1961</td>
<td class="org-left">Culinary Arts</td>
<td class="org-left">123 Franklin Street</td>
</tr>

<tr>
<td class="org-left">Michelle</td>
<td class="org-left">MacArthur</td>
<td class="org-left">03/26/1999</td>
<td class="org-left">Physics</td>
<td class="org-left">123 Franklin Street</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
But consider the following fact: For each major we may wish to store
other information (like the building it operates out of, the courses
you must complete for it, the current head of the department,
etc). And this is true for addresses also (some addresses may be
dormitories on campus, for instance). We could put these extra columns
into the above table in some cases (although putting a row in this
table for each course required by each major seems a bit absurd), but
that still leaves a lot of potential for error.
</p>

<p>
For example, if a student changes her address, we must find every row
that student appears and modify their address. If we forget or make a
mistake, the data begins to become trecherous and misleading.
</p>

<p>
Thus we normalize our databases, which means, basically, that we have
one table for each sort of thing and we record information only once
in the whole database. 
</p>

<p>
The above data might be stored as something like:
</p>

<table id="org907b44a" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">student<sub>id</sub></th>
<th scope="col" class="org-left">first<sub>name</sub></th>
<th scope="col" class="org-left">last<sub>name</sub></th>
<th scope="col" class="org-right">major<sub>id</sub></th>
<th scope="col" class="org-right">address<sub>id</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Nathan</td>
<td class="org-left">Hedley</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Michelle</td>
<td class="org-left">MacArthur</td>
<td class="org-right">10</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<table id="org5f1e7aa" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">major<sub>id</sub></th>
<th scope="col" class="org-left">text<sub>name</sub></th>
<th scope="col" class="org-left">department<sub>head</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Culinary Arts</td>
<td class="org-left">Swedish Chef</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Physics</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table id="org6588a5a" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">major<sub>id</sub></th>
<th scope="col" class="org-right">course<sub>id</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
And you can imagine further. 
</p>

<p>
With this sort of design if something changes about a course (for
instance, its description) we only need to update one entry in one
table. The rest of the data remains coherent. 
</p>

<p>
The price to pay for splitting our data up like this is, of course,
that any particular question we might want to ask requires crawling
all over the database.
</p>

<p>
Consider a question like: What courses does Nathan Hedly need to take
to finish his major?
</p>

<p>
Consider a more interesting question:
</p>

<p>
Of all the students taking Physics 330 who are also physics majors,
what is the average number of courses they have left to graduate?
</p>

<p>
The data we need to answer these questions is in our database, but we
need a way to <span class="underline">query</span> the database to extract it. Enter SQL!
</p>
</div>
</div>

<div id="outline-container-org907845e" class="outline-2">
<h2 id="org907845e"><span class="section-number-2">2</span> SQL</h2>
<div class="outline-text-2" id="text-2">
<p>
SQL is a programming language similar to the ones we already know but
strange in a few ways.
</p>

<ol class="org-ol">
<li>The chunks of text we must digest to know understand what an SQL
program does are large. In a regular language we can ask what "10"
means but SQL programs can only result in tables and thus we need
enough program to at least produce a table.</li>
<li>Its very verbose. Originally called the structured <span class="underline">english</span> query
language SQL makes a half-hearted attempt to make SQL programs seem
like english. This is a weird goal which is out of style.</li>
</ol>

<p>
Despite these considerations, we can make progress with SQL in more or
less the same way that we would in another language. 
</p>

<p>
Why should you, the budding data scientist, learn SQL?
</p>

<ol class="org-ol">
<li>You will probably need to extract data from an SQL database at some
point in your life.</li>
<li>Even if that never happens, you might need to put data into an SQL
database if its too big to fit in memory and you need to work with
it. Databases are designed to work on datasets much larger than you
can fit into a tibble or even load into memory.</li>
</ol>
</div>
</div>
