lectures/16-sql/notes.org
* SQLite

SQLite is a brilliant little piece of software which allows you to set
up and work with an SQL database in a single file on a disk. Other
than the filesystem max filesize there are no limits on how much data
you can put in your database (this is often terabytes or more). SQLite
is reasonably performant and very easy to use standalone. We can also
use it directly within R or Python to operate on dataframes, which can
be convenient in certain circumstances (it is, for example, much
easier to work with pandas dataframes with SQL than with its own
horrible nest of built in operations).

* Using SQLite.

There is an SQLite package in the Ubunut repositories, but its usually
pretty out of date. Better to compile it ourselves:

#+begin_src Dockerfile
RUN wget https://sqlite.org/snapshot/sqlite-snapshot-202110132029.tar.gz
RUN tar xvf sqlite-snapshot-202110132029.tar.gz
WORKDIR sqlite-snapshot-202110132029
RUN ./configure && make && make install
WORKDIR /
#+end_src

Once we have this going we can actually learn a few things about SQL
by just spinning up SQLite without any data at all:

#+begin_src 
docker build . -t 611 
docker run -it sqlite3
#+end_src

This will give us a read-eval-print loop where we can run a few
trivial snippets:

#+begin_src sh :results code :exports both
  rm -rf /tmp/example
  mkdir /tmp/example
#+end_src

#+RESULTS:
#+begin_src sh
#+end_src


#+begin_src sqlite :db "/tmp/example/db.sqlite" :results code :exports both :dir /tmp/example :colnames yes
select 10;
#+end_src

#+RESULTS:
#+begin_src sqlite
10
10
#+end_src

While there are ways to _insert_ data and modify data, as data
scientist we're  mostly interested in _accessing_ data. The first
thing to understand is that when we work with SQL EVERYTHING we
produce is a table. That can be made a a little clearer by naming the
column we just created:

#+begin_src sqlite :db "/tmp/example/db.sqlite" :results code :exports both :dir /tmp/example :colnames yes
select 10 as c2, 11 as c2;
#+end_src

#+RESULTS:
#+begin_src sqlite
c2,c2
10,11
#+end_src

Here SQLite is outputing its results as a CSV - this can be convenient
if we want to load it up into R afterward and we aren't using a direct
interface (of which more later).

What we've experimented with here is the "SELECT" statement. Most of
what we do with an SQL database starts with SELECT. SELECT is roughly
the equivalent of the "transmute" function in dplyr: we create a table
by typing a comma separated sequence of expressions that produce
values. These expressions are a lot like the programming languages you
already know:

#+begin_src sqlite :db "/tmp/example/db.sqlite" :results code :exports both :dir /tmp/example :colnames yes
select 10+13 as c2, 11+100 as c2;
#+end_src

#+RESULTS:
#+begin_src sqlite
c2,c2
23,111
#+end_src
 
We can even use strings and call a handful of functions on them:

#+begin_src sqlite :db "/tmp/example/db.sqlite" :results code :exports both :dir /tmp/example :colnames yes
select substr("ABCDEF",0,3) as c2, 11+100 as c2;
#+end_src

#+RESULTS:
#+begin_src sqlite
c2,c2
AB,111
#+end_src

Note from this example, we can see that SQLITE uses 0 based
indexing. SUBSTR has the behavior of a Python slice.

Notably absent from the expression language used in SQL is
_variables_. We can not create bindings or modify them. SQL is totally
"functional" there is no state.

To do anything non-trivial with SQLite we need to have some data. 

* Getting Data into the Database

Our goal here is to create a fresh SQLite database and load data into
it. The steps are:

1. Identify the "schema" of the data
2. Write a script that:
   a. creates the appropriate tables
   b. configures SQLITE to read our csvs
   c. reads the data in

Our data is the usual old stuff:

#+begin_src sh :results code :exports both
head source_data/powers.csv -n 2
#+end_src

#+RESULTS:
#+begin_src sh
power,character,universe,url
accelerated_healing,abraham_dusk,wildstorm_universe,https://dc.fandom.com/wiki/Abraham_Dusk_(Wildstorm_Universe)
#+end_src

And

#+begin_src sh :results code :exports both
head source_data/characters.csv -n 2
#+end_src

#+RESULTS:
#+begin_src sh
character,universe,property_name,value
abraham_dusk,wildstorm_universe,real_name,abraham_dusk
#+end_src

#+begin_src sh :results code :exports both
head source_data/character-page-data.csv -n 2
#+end_src

#+RESULTS:
#+begin_src sh
character,universe,page_length
Abraham Dusk,Wildstorm Universe,360879
#+end_src

SQL is a typed language, although SQLite doesn't enforce type
information.

Let's create a file called "import-data.lite.sql"

#+INCLUDE: "import-data.lite.sql" src sqlite :lines "1-25"

This just creates our Schema. 

We now need to tell SQLite that we want to load comma separated value
files.

#+INCLUDE: "import-data.lite.sql" src sqlite :lines "25-"

And that is it. Now we can create our database:

#+begin_src sh
rm -f comics.db
sqlite3 comics.db < import-data.lite.sql
#+end_src

#+RESULTS:

(Demo)

We can also just interact with the database directly from these notes:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select * from page_data limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|page_length
Abraham Dusk|Wildstorm Universe|360879.0
Accelerated Man|Earth 19|361310.0
Ahn Kwang-Jo|Prime Earth|390275.0
Alec Holland|Lego Batman|368585.0
Alec Holland|Prime Earth|401822.0
Alexander Fairchild|Wildstorm Universe|370234.0
Alexander Luthor|Smallville|440525.0
Alexander Staunton|Prime Earth|359330.0
Alexander Trent|New Earth|370103.0
Alonzo Malrey|New Earth|353685.0
#+end_src

Now we can learn a few things:

