lectures/16-sql/notes.html

<div id="outline-container-orgd3c69c5" class="outline-2">
<h2 id="orgd3c69c5"><span class="section-number-2">3</span> SQLite</h2>
<div class="outline-text-2" id="text-3">
<p>
SQLite is a brilliant little piece of software which allows you to set
up and work with an SQL database in a single file on a disk. Other
than the filesystem max filesize there are no limits on how much data
you can put in your database (this is often terabytes or more). SQLite
is reasonably performant and very easy to use standalone. We can also
use it directly within R or Python to operate on dataframes, which can
be convenient in certain circumstances (it is, for example, much
easier to work with pandas dataframes with SQL than with its own
horrible nest of built in operations).
</p>
</div>
</div>

<div id="outline-container-orga5edbbc" class="outline-2">
<h2 id="orga5edbbc"><span class="section-number-2">4</span> Using SQLite.</h2>
<div class="outline-text-2" id="text-4">
<p>
There is an SQLite package in the Ubunut repositories, but its usually
pretty out of date. Better to compile it ourselves:
</p>

<div class="org-src-container">
<pre class="src src-Dockerfile">RUN wget https://sqlite.org/snapshot/sqlite-snapshot-202110132029.tar.gz
RUN tar xvf sqlite-snapshot-202110132029.tar.gz
WORKDIR sqlite-snapshot-202110132029
RUN ./configure &amp;&amp; make &amp;&amp; make install
WORKDIR /
</pre>
</div>

<p>
Once we have this going we can actually learn a few things about SQL
by just spinning up SQLite without any data at all:
</p>

<pre class="example">
docker build . -t 611 
docker run -it sqlite3
</pre>

<p>
This will give us a read-eval-print loop where we can run a few
trivial snippets:
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -rf /tmp/example
mkdir /tmp/example
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> 10;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">10
10
</pre>
</div>

<p>
While there are ways to <span class="underline">insert</span> data and modify data, as data
scientist we're  mostly interested in <span class="underline">accessing</span> data. The first
thing to understand is that when we work with SQL EVERYTHING we
produce is a table. That can be made a a little clearer by naming the
column we just created:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> 10 <span style="color: #20b2aa; font-weight: bold;">as</span> c2, 11 <span style="color: #20b2aa; font-weight: bold;">as</span> c2;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">c2,c2
10,11
</pre>
</div>

<p>
Here SQLite is outputing its results as a CSV - this can be convenient
if we want to load it up into R afterward and we aren't using a direct
interface (of which more later).
</p>

<p>
What we've experimented with here is the "SELECT" statement. Most of
what we do with an SQL database starts with SELECT. SELECT is roughly
the equivalent of the "transmute" function in dplyr: we create a table
by typing a comma separated sequence of expressions that produce
values. These expressions are a lot like the programming languages you
already know:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> 10+13 <span style="color: #20b2aa; font-weight: bold;">as</span> c2, 11+100 <span style="color: #20b2aa; font-weight: bold;">as</span> c2;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">c2,c2
23,111
</pre>
</div>

<p>
We can even use strings and call a handful of functions on them:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> substr("ABCDEF",0,3) <span style="color: #20b2aa; font-weight: bold;">as</span> c2, 11+100 <span style="color: #20b2aa; font-weight: bold;">as</span> c2;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">c2,c2
AB,111
</pre>
</div>

<p>
Note from this example, we can see that SQLITE uses 0 based
indexing. SUBSTR has the behavior of a Python slice.
</p>

<p>
Notably absent from the expression language used in SQL is
<span class="underline">variables</span>. We can not create bindings or modify them. SQL is totally
"functional" there is no state.
</p>

<p>
To do anything non-trivial with SQLite we need to have some data. 
</p>
</div>
</div>

<div id="outline-container-org2ee4cc3" class="outline-2">
<h2 id="org2ee4cc3"><span class="section-number-2">5</span> Getting Data into the Database</h2>
<div class="outline-text-2" id="text-5">
<p>
Our goal here is to create a fresh SQLite database and load data into
it. The steps are:
</p>

<ol class="org-ol">
<li>Identify the "schema" of the data</li>
<li>Write a script that:
a. creates the appropriate tables
b. configures SQLITE to read our csvs
c. reads the data in</li>
</ol>

<p>
Our data is the usual old stuff:
</p>

<div class="org-src-container">
<pre class="src src-sh">head source_data/powers.csv -n 2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">power,character,universe,url
accelerated_healing,abraham_dusk,wildstorm_universe,https://dc.fandom.com/wiki/Abraham_Dusk_(Wildstorm_Universe)
</pre>
</div>

<p>
And
</p>

<div class="org-src-container">
<pre class="src src-sh">head source_data/characters.csv -n 2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">character,universe,property_name,value
abraham_dusk,wildstorm_universe,real_name,abraham_dusk
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">head source_data/character-page-data.csv -n 2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">character,universe,page_length
abraham_dusk,wildstorm_universe,360879
</pre>
</div>

<p>
SQL is a typed language, although SQLite doesn't enforce type
information.
</p>

<p>
Let's create a file called "import-data.lite.sql"
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">IF</span> <span style="color: #20b2aa; font-weight: bold;">EXISTS</span> powers;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">IF</span> <span style="color: #20b2aa; font-weight: bold;">EXISTS</span> properties;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">IF</span> <span style="color: #20b2aa; font-weight: bold;">EXISTS</span> page_data;

<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">powers</span> (
power text,
character_name text,
universe text,
url text
);

<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">properties</span> (
character_name text,
universe text,
property_name text,
property_value text
);

<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">page_data</span> (
character_name text,
universe text,
page_length <span style="color: #9370db;">real</span>
);
</pre>
</div>

<p>
This just creates our Schema. 
</p>

<p>
We now need to tell SQLite that we want to load comma separated value
files.
</p>

<div class="org-src-container">
<pre class="src src-sqlite">.mode csv
.header <span style="color: #20b2aa; font-weight: bold;">on</span>

.import <span style="color: #cd853f;">--csv --skip 1 source_data/character-page-data.csv page_data</span>

.import <span style="color: #cd853f;">--csv --skip 1 source_data/powers.csv powers</span>

.import <span style="color: #cd853f;">--csv --skip 1 source_data/characters.csv properties</span>
</pre>
</div>

<p>
And that is it. Now we can create our database:
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -f comics.db
sqlite3 comics.db &lt; import-data.lite.sql
</pre>
</div>

<p>
(Demo)
</p>

<p>
We can also just interact with the database directly from these notes:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> page_data <span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|page_length
abraham_dusk|wildstorm_universe|360879.0
accelerated_man|earth_19|361310.0
ahn_kwang_jo|prime_earth|390275.0
alec_holland|lego_batman|368585.0
alec_holland|prime_earth|401822.0
alexander_fairchild|wildstorm_universe|370234.0
alexander_luthor|smallville|440525.0
alexander_staunton|prime_earth|359330.0
alexander_trent|new_earth|370103.0
alonzo_malrey|new_earth|353685.0
</pre>
</div>

<p>
Now we can learn a few things:
</p>
</div>
</div>
