lectures/16-sql/notes.org
* SELECT

We used SELECT to generate a trivial table above, but more typically
you SELECT _FROM_ something:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select character_name from page_data limit 10;
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name
Abraham Dusk
Accelerated Man
Ahn Kwang-Jo
Alec Holland
Alec Holland
Alexander Fairchild
Alexander Luthor
Alexander Staunton
Alexander Trent
Alonzo Malrey
#+end_src

We often don't want an entire table, so the SELECT statement supports
a "WHERE" clause:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select * from page_data where substr(character_name, 0, 3) = "ka" limit 10;
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|page_length
kaizen_gamorra_yohn_kohl|wildstorm_universe|364704.0
kal_kent|dc_one_million|395600.0
kal_el|earth_one|1215737.0
kal_el|earth_prime|518432.0
katar_hol|the_batman_tv_series|370685.0
kay_challis|doom_patrol_tv_series|385329.0
kaja_dox|prime_earth|363369.0
kal|earth_32|364867.0
kal_el|justice_league_3|398793.0
kal_el|terra_occulta|360877.0
#+end_src

We can use AND, OR and NOT to combine tests in a where clause.

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select * from page_data 
where (substr(character_name,0,3) = "ka" or
 substr(character_name,0,3) = "su") and
 page_length >= 500000
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|page_length
kal_el|earth_one|1215737.0
kal_el|earth_prime|518432.0
superman|clark_kent|575295.0
kara_zor_el|earth_one|553139.0
kara_zor_el|new_earth|567026.0
kal_el|new_earth|790094.0
kara_zor_el|prime_earth|546627.0
#+end_src

Note that we use parentheses to group conditions.

As promised, select also allows you to cook up new columns:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select character_name as c, 
 universe as u, 
 round(page_length/1000) as page_length_thousands 
from page_data 
where (substr(character_name,0,3) = "ka" or
 substr(character_name,0,3) = "su") and
 page_length >= 500000
#+end_src

#+RESULTS:
#+begin_src sqlite
c|u|page_length_thousands
kal_el|earth_one|1216.0
kal_el|earth_prime|518.0
superman|clark_kent|575.0
kara_zor_el|earth_one|553.0
kara_zor_el|new_earth|567.0
kal_el|new_earth|790.0
kara_zor_el|prime_earth|547.0
#+end_src

Select also supports group operations. Note that when we group_by
every expression in our select must be an "aggregate" function. One
that takes _all_ the elements in the group and returns a single
element.

For example, here is a summary of the number of bytes total for each
universe:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select universe,
 sum(page_length) as page_length
from page_data
group by universe
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
universe|page_length
1941_superman_cartoons|366804.0
a_tragedy|1429166.0
absorbasco|348288.0
act_of_god|348498.0
action_comics_vol_1_2|372343.0
action_comics_vol_1_53|407412.0
action_comics_vol_1_54|393529.0
action_comics_vol_1_6|462944.0
adventure_comics_vol_1_39|370273.0
adventures_of_captain_marvel_1941_serial|714402.0
#+end_src

Note that we _can_ use any name or value in the group by clause
without an aggregate function around it.

We often want to order our results. This is different depending on
whether you are ordering a normal query or the results of a group by.

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select * from page_data
order by page_length desc
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|page_length
kal_el|earth_one|1215737.0
bruce_wayne|new_earth|848293.0
kal_el|new_earth|790094.0
batman|bruce_wayne|661515.0
flash|barry_allen|660719.0
orin|new_earth|657000.0
wonder_woman|diana_prince|656532.0
aquaman|arthur_curry|656008.0
diana_of_themyscira|new_earth|646638.0
guy_gardner|new_earth|609453.0
#+end_src

Or ascending:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select * from page_data
order by page_length asc
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|page_length
beast_men|beast_me|340441.0
inertron|inertro|342643.0
star_conquerors|star_conqueror|342673.0
imskians|imskian|342734.0
paula_s_space_transformer|paula_s_space_transforme|342846.0
ultima_thule|ultima_thul|343001.0
transmatter_cube|transmatter_cub|343242.0
bane|earth_9|343585.0
dev_em_i|dc_extended_universe|343593.0
touch_stones|touch_stone|343654.0
#+end_src

(Lots of garbage in this data set!)

If you are sorting a group then you need to use the ORDER BY pattern:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select universe,
 sum(page_length) as page_length
from page_data
group by universe
order by page_length desc
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
universe|page_length
new_earth|1079849524.0
prime_earth|585828539.0
earth_one|148180034.0
dcau|103740280.0
wildstorm_universe|93304628.0
arrowverse|80028114.0
pre_zero_hour|69158887.0
earth_16|63877393.0
smallville|57053184.0
earth_two|52836887.0
#+end_src

This covers most of what you can do with the SELECT statement. Happily
SQLite has relatively recently come to support Windowing and
Partitioning, but I won't cover them in class. A guide is linked in
the notes. 

