lectures/16-sql/notes.html

<div id="outline-container-orga2792f3" class="outline-2">
<h2 id="orga2792f3"><span class="section-number-2">6</span> SELECT</h2>
<div class="outline-text-2" id="text-6">
<p>
We used SELECT to generate a trivial table above, but more typically
you SELECT <span class="underline">FROM</span> something:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> character_name <span style="color: #20b2aa; font-weight: bold;">from</span> page_data <span style="color: #20b2aa; font-weight: bold;">limit</span> 10;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name
abraham_dusk
accelerated_man
ahn_kwang_jo
alec_holland
alec_holland
alexander_fairchild
alexander_luthor
alexander_staunton
alexander_trent
alonzo_malrey
</pre>
</div>

<p>
We often don't want an entire table, so the SELECT statement supports
a "WHERE" clause:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> page_data <span style="color: #20b2aa; font-weight: bold;">where</span> substr(character_name, 0, 3) = "ka" <span style="color: #20b2aa; font-weight: bold;">limit</span> 10;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|page_length
kaizen_gamorra_yohn_kohl|wildstorm_universe|364704.0
kal_kent|dc_one_million|395600.0
kal_el|earth_one|1215737.0
kal_el|earth_prime|518432.0
katar_hol|the_batman_tv_series|370685.0
kay_challis|doom_patrol_tv_series|385329.0
kaja_dox|prime_earth|363369.0
kal|earth_32|364867.0
kal_el|justice_league_3|398793.0
kal_el|terra_occulta|360877.0
</pre>
</div>

<p>
We can use AND, OR and NOT to combine tests in a where clause.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> page_data 
<span style="color: #20b2aa; font-weight: bold;">where</span> (substr(character_name,0,3) = "ka" <span style="color: #20b2aa; font-weight: bold;">or</span>
 substr(character_name,0,3) = "su") <span style="color: #20b2aa; font-weight: bold;">and</span>
 page_length &gt;= 500000
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|page_length
kal_el|earth_one|1215737.0
kal_el|earth_prime|518432.0
superman|clark_kent|575295.0
kara_zor_el|earth_one|553139.0
kara_zor_el|new_earth|567026.0
kal_el|new_earth|790094.0
kara_zor_el|prime_earth|546627.0
</pre>
</div>

<p>
Note that we use parentheses to group conditions.
</p>

<p>
As promised, select also allows you to cook up new columns:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> character_name <span style="color: #20b2aa; font-weight: bold;">as</span> c, 
 universe <span style="color: #20b2aa; font-weight: bold;">as</span> u, 
 round(page_length/1000) <span style="color: #20b2aa; font-weight: bold;">as</span> page_length_thousands 
<span style="color: #20b2aa; font-weight: bold;">from</span> page_data 
<span style="color: #20b2aa; font-weight: bold;">where</span> (substr(character_name,0,3) = "ka" <span style="color: #20b2aa; font-weight: bold;">or</span>
 substr(character_name,0,3) = "su") <span style="color: #20b2aa; font-weight: bold;">and</span>
 page_length &gt;= 500000
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">c|u|page_length_thousands
kal_el|earth_one|1216.0
kal_el|earth_prime|518.0
superman|clark_kent|575.0
kara_zor_el|earth_one|553.0
kara_zor_el|new_earth|567.0
kal_el|new_earth|790.0
kara_zor_el|prime_earth|547.0
</pre>
</div>

<p>
Select also supports group operations. Note that when we group<sub>by</sub>
every expression in our select must be an "aggregate" function. One
that takes <span class="underline">all</span> the elements in the group and returns a single
element.
</p>

<p>
For example, here is a summary of the number of bytes total for each
universe:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> universe,
 <span style="color: #76ee00;">sum</span>(page_length) <span style="color: #20b2aa; font-weight: bold;">as</span> page_length
<span style="color: #20b2aa; font-weight: bold;">from</span> page_data
<span style="color: #20b2aa; font-weight: bold;">group</span> <span style="color: #20b2aa; font-weight: bold;">by</span> universe
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">universe|page_length
1941_superman_cartoons|366804.0
a_tragedy|1429166.0
absorbasco|348288.0
act_of_god|348498.0
action_comics_vol_1_2|372343.0
action_comics_vol_1_53|407412.0
action_comics_vol_1_54|393529.0
action_comics_vol_1_6|462944.0
adventure_comics_vol_1_39|370273.0
adventures_of_captain_marvel_1941_serial|714402.0
</pre>
</div>

<p>
Note that we <span class="underline">can</span> use any name or value in the group by clause
without an aggregate function around it.
</p>

<p>
We often want to order our results. This is different depending on
whether you are ordering a normal query or the results of a group by.
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> page_data
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> page_length <span style="color: #20b2aa; font-weight: bold;">desc</span>
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|page_length
kal_el|earth_one|1215737.0
bruce_wayne|new_earth|848293.0
kal_el|new_earth|790094.0
batman|bruce_wayne|661515.0
flash|barry_allen|660719.0
orin|new_earth|657000.0
wonder_woman|diana_prince|656532.0
aquaman|arthur_curry|656008.0
diana_of_themyscira|new_earth|646638.0
guy_gardner|new_earth|609453.0
</pre>
</div>

<p>
Or ascending:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> page_data
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> page_length <span style="color: #20b2aa; font-weight: bold;">asc</span>
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|page_length
beast_men|beast_me|340441.0
inertron|inertro|342643.0
star_conquerors|star_conqueror|342673.0
imskians|imskian|342734.0
paula_s_space_transformer|paula_s_space_transforme|342846.0
ultima_thule|ultima_thul|343001.0
transmatter_cube|transmatter_cub|343242.0
bane|earth_9|343585.0
dev_em_i|dc_extended_universe|343593.0
touch_stones|touch_stone|343654.0
</pre>
</div>

<p>
(Lots of garbage in this data set!)
</p>

<p>
If you are sorting a group then you need to use the ORDER BY pattern:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> universe,
 <span style="color: #76ee00;">sum</span>(page_length) <span style="color: #20b2aa; font-weight: bold;">as</span> page_length
<span style="color: #20b2aa; font-weight: bold;">from</span> page_data
<span style="color: #20b2aa; font-weight: bold;">group</span> <span style="color: #20b2aa; font-weight: bold;">by</span> universe
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> page_length <span style="color: #20b2aa; font-weight: bold;">desc</span>
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">universe|page_length
new_earth|1079849524.0
prime_earth|585828539.0
earth_one|148180034.0
dcau|103740280.0
wildstorm_universe|93304628.0
arrowverse|80028114.0
pre_zero_hour|69158887.0
earth_16|63877393.0
smallville|57053184.0
earth_two|52836887.0
</pre>
</div>

<p>
This covers most of what you can do with the SELECT statement. Happily
SQLite has relatively recently come to support Windowing and
Partitioning, but I won't cover them in class. A guide is linked in
the notes. 
</p>
</div>
</div>
