lectures/16-sql/notes.org
* JOINS

Because many databases are normalized, you will almost certainly need
to perform joins. Joins are straightforward enough:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
select p.character_name, p.universe, o.power from page_data p
join powers o on o.character_name = p.character_name 
             and o.universe = p.universe
order by p.page_length desc
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
character_name|universe|power
kal_el|earth_one|accelerated_healing
kal_el|earth_one|chronokinesis
kal_el|earth_one|decelerated_aging
kal_el|earth_one|dimensional_travel
kal_el|earth_one|energy_absorption
kal_el|earth_one|enhanced_hearing
kal_el|earth_one|enhanced_sense_of_smell
kal_el|earth_one|enhanced_senses
kal_el|earth_one|enhanced_vision
kal_el|earth_one|flight
#+end_src

Note that in order to make the join a little more concise we gave
short names to the tables.

Its important to think about the order of the different parts of an
SQL query:

You must _join_ before you can group by. You must filter after you
join but before you group.

That reminds me: if you group and want to filter the results you use a
"HAVING" expression.

* CTEs (Common Table Expressions)

It is very handy to create temporary tables on your way to a
result. You can do this like this:

#+begin_src sqlite
create table kal_el as 
select * from powers where character_name = "kal_el";

<do stuff>

drop table kal_el;
#+end_src

But instead of faffing around with remembering to delete these tables
you can also just use a CTE:

#+begin_src sqlite :db "comics.db" :results code :exports both  :colnames yes :list
with kal_el_powers as (select * from powers where character_name = "kal_el")
select power, sum(1) as count from kal_el_powers group by power 
order by sum(1) desc
limit 10
#+end_src

#+RESULTS:
#+begin_src sqlite
power|count
superhuman_strength|132
flight|132
superhuman_speed|128
thermal_blast|127
invulnerability|126
enhanced_vision|126
enhanced_hearing|123
energy_absorption|122
superhuman_stamina|120
super_breath|119
#+end_src


Note that creating such temporary tables can often lead to a big
improvement in the performance of your query: filtering down to just
the subset of data you care about _before_ doing a join can
drastically improve the speed of the results.

* Saving the Results of a Query

Saving the results of a query is pretty easy.

One possibility is to just create a table in your db as above. As we
will see, its easy to access tables from R or Python, so creating a
table in the db is an ok solution.

Another option is to ask SQLite to dump the results for you.

#+INCLUDE: "dump_kal_el_powers.lite.sql" src sqlite

We can dump like this:

#+begin_src sh :results code :exports both
sqlite3 comics.db < dump_kal_el_powers.lite.sql
cat kal_el.csv | head
#+end_src

#+RESULTS:
#+begin_src sh
power,count
superhuman_strength,132
flight,132
superhuman_speed,128
thermal_blast,127
invulnerability,126
enhanced_vision,126
enhanced_hearing,123
energy_absorption,122
superhuman_stamina,120
#+end_src

* Using R to Work with SQL(lite)

#+begin_src Dockerfile
RUN R -e "install.package('RSQLite')";
#+end_src

#+begin_src R :results code :exports both
library(DBI)
con <- dbConnect(RSQLite::SQLite(), "comics.db")
dbListTables(con)
#+end_src

#+RESULTS:
#+begin_src R
page_data
powers
properties
#+end_src

#+begin_src R :results code :exports both
library(DBI)
con <- dbConnect(RSQLite::SQLite(), "comics.db")
r <- dbGetQuery(con, "select * from powers limit 10")
dbDisconnect(con);
r
#+end_src

#+RESULTS:
#+begin_src R
accelerated_healing	abraham_dusk	wildstorm_universe	https://dc.fandom.com/wiki/Abraham_Dusk_(Wildstorm_Universe)
accelerated_healing	accelerated_man	earth	https://dc.fandom.com/wiki/Accelerated_Man_(Earth_19)
accelerated_healing	ahn_kwang_jo	prime_earth	https://dc.fandom.com/wiki/Ahn_Kwang-Jo_(Prime_Earth)
accelerated_healing	alec_holland	lego_batman	https://dc.fandom.com/wiki/Alec_Holland_(Lego_Batman)
accelerated_healing	alec_holland	prime_earth	https://dc.fandom.com/wiki/Alec_Holland_(Prime_Earth)
accelerated_healing	alexander_fairchild	wildstorm_universe	https://dc.fandom.com/wiki/Alexander_Fairchild_(Wildstorm_Universe)
accelerated_healing	alexander_luthor	smallville	https://dc.fandom.com/wiki/Alexander_Luthor_(Smallville)
accelerated_healing	alexander_staunton	prime_earth	https://dc.fandom.com/wiki/Alexander_Staunton_(Prime_Earth)
accelerated_healing	alexander_trent	new_earth	https://dc.fandom.com/wiki/Alexander_Trent_(New_Earth)
accelerated_healing	alonzo_malrey	new_earth	https://dc.fandom.com/wiki/Alonzo_Malrey_(New_Earth)
#+end_src

* More to Come

We'll talk about accessing this data from Python Wed and then seque
into using Pandas then.
