lectures/16-sql/notes.html

<div id="outline-container-org12f4a98" class="outline-2">
<h2 id="org12f4a98"><span class="section-number-2">7</span> JOINS</h2>
<div class="outline-text-2" id="text-7">
<p>
Because many databases are normalized, you will almost certainly need
to perform joins. Joins are straightforward enough:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">select</span> p.character_name, p.universe, o.power <span style="color: #20b2aa; font-weight: bold;">from</span> page_data p
<span style="color: #20b2aa; font-weight: bold;">join</span> powers o <span style="color: #20b2aa; font-weight: bold;">on</span> o.character_name = p.character_name 
             <span style="color: #20b2aa; font-weight: bold;">and</span> o.universe = p.universe
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> p.page_length <span style="color: #20b2aa; font-weight: bold;">desc</span>
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">character_name|universe|power
kal_el|earth_one|accelerated_healing
kal_el|earth_one|chronokinesis
kal_el|earth_one|decelerated_aging
kal_el|earth_one|dimensional_travel
kal_el|earth_one|energy_absorption
kal_el|earth_one|enhanced_hearing
kal_el|earth_one|enhanced_sense_of_smell
kal_el|earth_one|enhanced_senses
kal_el|earth_one|enhanced_vision
kal_el|earth_one|flight
</pre>
</div>

<p>
Note that in order to make the join a little more concise we gave
short names to the tables.
</p>

<p>
Its important to think about the order of the different parts of an
SQL query:
</p>

<p>
You must <span class="underline">join</span> before you can group by. You must filter after you
join but before you group.
</p>

<p>
That reminds me: if you group and want to filter the results you use a
"HAVING" expression.
</p>
</div>
</div>

<div id="outline-container-org91d3eff" class="outline-2">
<h2 id="org91d3eff"><span class="section-number-2">8</span> CTEs (Common Table Expressions)</h2>
<div class="outline-text-2" id="text-8">
<p>
It is very handy to create temporary tables on your way to a
result. You can do this like this:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">create</span> <span style="color: #20b2aa; font-weight: bold;">table</span> <span style="color: #00ff7f;">kal_el</span> <span style="color: #20b2aa; font-weight: bold;">as</span> 
<span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> powers <span style="color: #20b2aa; font-weight: bold;">where</span> character_name = "kal_el";

&lt;do stuff&gt;

<span style="color: #20b2aa; font-weight: bold;">drop</span> <span style="color: #20b2aa; font-weight: bold;">table</span> <span style="color: #00ff7f;">kal_el</span>;
</pre>
</div>

<p>
But instead of faffing around with remembering to delete these tables
you can also just use a CTE:
</p>

<div class="org-src-container">
<pre class="src src-sqlite"><span style="color: #20b2aa; font-weight: bold;">with</span> kal_el_powers <span style="color: #20b2aa; font-weight: bold;">as</span> (<span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> powers <span style="color: #20b2aa; font-weight: bold;">where</span> character_name = "kal_el")
<span style="color: #20b2aa; font-weight: bold;">select</span> power, <span style="color: #76ee00;">sum</span>(1) <span style="color: #20b2aa; font-weight: bold;">as</span> <span style="color: #76ee00;">count</span> <span style="color: #20b2aa; font-weight: bold;">from</span> kal_el_powers <span style="color: #20b2aa; font-weight: bold;">group</span> <span style="color: #20b2aa; font-weight: bold;">by</span> power 
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> <span style="color: #76ee00;">sum</span>(1) <span style="color: #20b2aa; font-weight: bold;">desc</span>
<span style="color: #20b2aa; font-weight: bold;">limit</span> 10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sqlite">power|<span style="color: #76ee00;">count</span>
superhuman_strength|132
flight|132
superhuman_speed|128
thermal_blast|127
invulnerability|126
enhanced_vision|126
enhanced_hearing|123
energy_absorption|122
superhuman_stamina|120
super_breath|119
</pre>
</div>


<p>
Note that creating such temporary tables can often lead to a big
improvement in the performance of your query: filtering down to just
the subset of data you care about <span class="underline">before</span> doing a join can
drastically improve the speed of the results.
</p>
</div>
</div>

<div id="outline-container-org978e694" class="outline-2">
<h2 id="org978e694"><span class="section-number-2">9</span> Saving the Results of a Query</h2>
<div class="outline-text-2" id="text-9">
<p>
Saving the results of a query is pretty easy.
</p>

<p>
One possibility is to just create a table in your db as above. As we
will see, its easy to access tables from R or Python, so creating a
table in the db is an ok solution.
</p>

<p>
Another option is to ask SQLite to dump the results for you.
</p>

<div class="org-src-container">
<pre class="src src-sqlite">.mode csv
.separator ,
.headers <span style="color: #20b2aa; font-weight: bold;">on</span>
.once kal_el.csv

<span style="color: #20b2aa; font-weight: bold;">with</span> kal_el_powers <span style="color: #20b2aa; font-weight: bold;">as</span> (<span style="color: #20b2aa; font-weight: bold;">select</span> * <span style="color: #20b2aa; font-weight: bold;">from</span> powers <span style="color: #20b2aa; font-weight: bold;">where</span> character_name = "kal_el")
<span style="color: #20b2aa; font-weight: bold;">select</span> power, <span style="color: #76ee00;">sum</span>(1) <span style="color: #20b2aa; font-weight: bold;">as</span> <span style="color: #76ee00;">count</span> <span style="color: #20b2aa; font-weight: bold;">from</span> kal_el_powers <span style="color: #20b2aa; font-weight: bold;">group</span> <span style="color: #20b2aa; font-weight: bold;">by</span> power 
<span style="color: #20b2aa; font-weight: bold;">order</span> <span style="color: #20b2aa; font-weight: bold;">by</span> <span style="color: #76ee00;">sum</span>(1) <span style="color: #20b2aa; font-weight: bold;">desc</span>
</pre>
</div>

<p>
We can dump like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">sqlite3 comics.db &lt; dump_kal_el_powers.lite.sql
cat kal_el.csv | head
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">power,count
superhuman_strength,132
flight,132
superhuman_speed,128
thermal_blast,127
invulnerability,126
enhanced_vision,126
enhanced_hearing,123
energy_absorption,122
superhuman_stamina,120
</pre>
</div>
</div>
</div>

<div id="outline-container-org07cf9d2" class="outline-2">
<h2 id="org07cf9d2"><span class="section-number-2">10</span> Using R to Work with SQL(lite)</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-Dockerfile">RUN R -e "install.package('RSQLite')";
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #1e90ff;">library</span>(DBI)
con <span style="color: #1e90ff;">&lt;-</span> dbConnect(RSQLite::SQLite(), <span style="color: #ffa07a;">"comics.db"</span>)
dbListTables(con)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">page_data
powers
properties
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #1e90ff;">library</span>(DBI)
con <span style="color: #1e90ff;">&lt;-</span> dbConnect(RSQLite::SQLite(), <span style="color: #ffa07a;">"comics.db"</span>)
r <span style="color: #1e90ff;">&lt;-</span> dbGetQuery(con, <span style="color: #ffa07a;">"select * from powers limit 10"</span>)
dbDisconnect(con);
r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">accelerated_healing     abraham_dusk    wildstorm_universe      https://dc.fandom.com/wiki/Abraham_Dusk_(Wildstorm_Universe)
accelerated_healing     accelerated_man earth   https://dc.fandom.com/wiki/Accelerated_Man_(Earth_19)
accelerated_healing     ahn_kwang_jo    prime_earth     https://dc.fandom.com/wiki/Ahn_Kwang-Jo_(Prime_Earth)
accelerated_healing     alec_holland    lego_batman     https://dc.fandom.com/wiki/Alec_Holland_(Lego_Batman)
accelerated_healing     alec_holland    prime_earth     https://dc.fandom.com/wiki/Alec_Holland_(Prime_Earth)
accelerated_healing     alexander_fairchild     wildstorm_universe      https://dc.fandom.com/wiki/Alexander_Fairchild_(Wildstorm_Universe)
accelerated_healing     alexander_luthor        smallville      https://dc.fandom.com/wiki/Alexander_Luthor_(Smallville)
accelerated_healing     alexander_staunton      prime_earth     https://dc.fandom.com/wiki/Alexander_Staunton_(Prime_Earth)
accelerated_healing     alexander_trent new_earth       https://dc.fandom.com/wiki/Alexander_Trent_(New_Earth)
accelerated_healing     alonzo_malrey   new_earth       https://dc.fandom.com/wiki/Alonzo_Malrey_(New_Earth)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8dfa35" class="outline-2">
<h2 id="orge8dfa35"><span class="section-number-2">11</span> More to Come</h2>
<div class="outline-text-2" id="text-11">
<p>
We'll talk about accessing this data from Python Wed and then seque
into using Pandas then.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: toups</p>
<p class="date">Created: 2021-10-25 Mon 15:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
